{"data":{"markdownRemark":{"html":"<p>Today I'm thankful for exercism and my path to open source.</p>\n<p>I started programming when I was around 12 years old. Not sure what it\nwas, but I just had some driving curiosity to learn programming.\nI had read online about some language called Java so I wanted to learn that.\nI signed up for codecademy and started learning JavaScript. I got around\nhalf way through the course when I found out that Java and JavaScript were\nnot the same thing.</p>\n<p>Around this time was also when I had been learning linux skills. I had a\nNook Tablet that I used. I wanted full android on it and bought some sd\ncard that I could use to dual boot it. I used this for a while and eventually\nlearned about jailbreaking and rooting. I wanted to root my tablet, and I found\nout that the dual boot system had team win recovery program installed, which\nI used to flash cyanogenmod. I learned to use the terminal and how to change\nmy mac address to get around some internet restrictions my parents had in place.</p>\n<p>Anyways, after I had realized I hadn't been learning Java, I checked out some\nbooks from the library about it. I re-read chapters of them over and over trying\nto understand. I was confused about words like <code class=\"language-text\">static</code> and <code class=\"language-text\">void</code>. Eventually,\nour family moved and I had the opportunity to learn Java at the high school.</p>\n<p>I took an introductory Java course and one day it just clicked for me and everything\nstarted making sense. The next year, I took AP Computer Science A and scored\na 5 on the exam.</p>\n<p>Where does open source fit into this?\nWell, my first pull request was made to <a href=\"https://github.com/PokemonGoF/PokemonGo-Web/pull/85\">PokemonGoF/PokemonGo-Web</a>\non October 2, 2016. This was about half way through my AP Computer Science class.\nThe pull request simply removed the arrow-functions to support older browsers.</p>\n<p>Then, at the end of that school year, I started contributing to <a href=\"https://github.com/exercism/java\">exercism/java</a>.\nFrom May 2017 through July 2017, I opened numerous pull requests.\nI started with some simple things, fixing a few lines of code here and there,\nand continued to implement new exercises and rework documentation.</p>\n<p>In July 2017, I was invited to maintain the Java track. Since then, I've been\na part of exercism and I was able to see the transition from v1 to v2. I have\nbeen less involved since because of school and life, but I still try to contribute\nhere and there when I can.</p>\n<p>I've also had the opportunity to mentor people's exercises on exercism. I love to\nhelp others better their code, and I always appreciate the help people give me\non my submitted solutions.</p>\n<p>The experience I have gained through contributing to exercism has been invaluable\nto me. At 17, I can currently say that I have contributed to real-world projects.\nExercism has helped me improve my programming skills as well, and I've had several\ninternships since then that I may not have had without.</p>","fields":{"slug":"/blog/2018-11-22Thanksgiving-MyPathToOpenSource/"},"frontmatter":{"date":"November 22, 2018","title":"Thanksgiving; My Path to Open Source and Exercism"}}},"pageContext":{}}