{"data":{"markdownRemark":{"html":"<p>Poof, a website appeared!</p>\n<p>Cool right?</p>\n<p>I actually had a website before this.\nIt looked kinda similar with the same colors and footer.\nThe header was a little different,\nbut the rest was remade. </p>\n<p>Why?</p>\n<p>Because I took a look at it right after making it (literally yesterday) and was like\n\"Well, this website is actually awful\"\nand so I remade it.</p>\n<p>The old website can be found <a href=\"https://github.com/Smarticles101/loganstucki.me\">here</a>\nif you really want to see it. It's made with ReactJS using create-react-app.\nI spent about a week on it working on it in my free time.</p>\n<p>This website uses React as well, but it also uses GatsbyJS.\nI looked into using something like Jekyll, cause I wanted a blog\nand I wanted static content because React just manipulates the DOM dynamically.</p>\n<p>GatsbyJS does just this and as a plus, it used most of my existing React code\nto run. Neat right?</p>\n<p>I installed a plugin to parse markdown. Gatsby utilizes GraphQL (the coveted\nquery language that developers are hyped up about) for stuff. I don't know GraphQL that well.\nAs of before today, I had never used it before. Luckily, Gatsby has really good docs\nwith lots of examples for different senarios. That really helped me alot.</p>\n<p>So yeah, now I have this new website. Pretty nifty. Press one of the little contact\nbuttons in the footer to get in touch. Also, if you've somehow managed to get through\nthe site and read through this entire post, will you email me feedback on the site?\nI haven't added much styling to the blog post. Is the blue too light to read? How about\nthe rest of the site. Is it okay? I'm not a UX designer, I'm just a kid who codes.\nI need to know this stuff.</p>\n<p>Until next time, signing off - Logan</p>\n<pre><code class=\"language-javascript\">console.log('lol')\n// oh look code blocks work.\n// there isn't syntax hilighting though\n// gotta find some styles for that\n</code></pre>","frontmatter":{"date":"November 07, 2017","path":"/blog/2017-11-07LookMaIMadeAWebsite","title":"Look ma I made a website"}}},"pageContext":{}}