{"data":{"markdownRemark":{"html":"<p>Today is the first day of a new year! Tons of fun.\nI'm going to outline some plans for this year.</p>\n<h3>1. Finish high school</h3>\n<p>One more semester left of high school!</p>\n<p>Classes I'm taking this semester:</p>\n<ul>\n<li>AP Calculus AB</li>\n<li>AP English Literature</li>\n<li>Choir</li>\n<li>Economics</li>\n<li>Ignite/Internship</li>\n</ul>\n<p>I'm aiming for a 4 or 5 on my AP Calulus exam, but english\nis a weaker area for me so I'm hoping for a 3.</p>\n<h3>2. Apply for scholarships</h3>\n<p>I would like to apply for a bunch of scholarships\nbefore I head off to college. Hopefully I can get\npeople to pay for my education so I don't drown in\nstudent loan debt :)</p>\n<h3>3. Get a summer internship and maybe a part time job</h3>\n<p>Last summer, I was able to intern with Walmart in\ntheir infosec department. I'd love to be able to do\nthat again in a different area. If this works out, I'd\nprobably quit my current job at Sonic. I could also\npotentially turn an internship into a remote job while I'm in college.</p>\n<h3>4. Be more actively involved in open source</h3>\n<p>Currently, I am a member of <a href=\"https://exercism.io\">exercism</a>. I\nwould like to more actively contribute there, or possibly\nfind some smaller projects I can contribute to. I might\neven start my own if I can find a good idea.</p>\n<h3>5. College</h3>\n<p>I've applied to 3 different colleges for the 2019 fall semester.</p>\n<p>I've chosen BYU as my primary choice, and am currently awaiting an\nadmission decision, which I expect in Febuary.</p>\n<p>BYU-Idaho is my backup, in case BYU doesn't work out or I don't\nget the funds for it. Already accepted here.</p>\n<p>University of Arkansas is my last fallback. If for some reason\nmy other options don't follow through, I'll go here and stay\ncloser to home. I was also already accepted here.</p>\n<h3>In closing</h3>\n<p>So yeah those are my plans for 2019 as they currently stand.</p>\n<p>My main concerns for this year are grades as I finish high school,\nand funding my college education.</p>\n<p>Wish me luck! :)</p>","fields":{"slug":"/blog/2019-01-01NewYearPlans/"},"frontmatter":{"date":"January 01, 2019","title":"My Plans for 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}